- pandas -- Panel Data
- Any data used for research or study purposes
- Objects --> 1 .Series -- 1 Column Multiple rows
              2. Data Frame -- multiple rows and columns
- Built on numpy

In [3]:
import pandas as pd

In [4]:
## Creating empty series
d=pd.Series()

C:\Users\Dell\AppData\Local\Temp\ipykernel_14364\779336895.py:2: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  d=pd.Series()

In [5]:
d

Series([], dtype: float64)

In [6]:
e=pd.DataFrame()

In [10]:
print(type(e))
print(type(d))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [11]:
## Creating series with one element
d=pd.Series(17)

In [12]:
d

0    17
dtype: int64

In [13]:
## Creating series using tuple
t=(10,11,12)
d=pd.Series(t)
d

0    10
1    11
2    12
dtype: int64

In [2]:
tup1=(4,8,5,4,5,8,7,9,4,8,2,8,4,)

In [17]:
list1=list(tup1)

In [3]:
import pandas as pd

In [5]:
ser1=pd.Series(tup1)

In [6]:
ser1

0     4
1     8
2     5
3     4
4     5
5     8
6     7
7     9
8     4
9     8
10    2
11    8
12    4
dtype: int64

In [7]:
##  creating series using list
l1=[45,78,56,445,78]
d=pd.Series(l1)
d

0     45
1     78
2     56
3    445
4     78
dtype: int64

In [8]:
## Creating series with array

In [9]:
tup1

(4, 8, 5, 4, 5, 8, 7, 9, 4, 8, 2, 8, 4)

In [10]:
import numpy as np
arr1= np.array(tup1)

In [12]:
type(arr1)

numpy.ndarray

In [16]:
ser2= pd.Series(arr1)
ser2

0     4
1     8
2     5
3     4
4     5
5     8
6     7
7     9
8     4
9     8
10    2
11    8
12    4
dtype: int32

In [15]:
type(ser2)

pandas.core.series.Series

In [19]:
tup1

(4, 8, 5, 4, 5, 8, 7, 9, 4, 8, 2, 8, 4)

In [20]:
list1

[4, 8, 5, 4, 5, 8, 7, 9, 4, 8, 2, 8, 4]

In [24]:
tup1[::-1]

(4, 8, 2, 8, 4, 9, 7, 8, 5, 4, 5, 8, 4)

In [25]:
## Creating series with array
import numpy as np
arr=np.array([1,2,3,4])
d1=pd.Series(arr)
d1

0    1
1    2
2    3
3    4
dtype: int32

In [26]:
arr2= np.array([[1,2],[3,4],[5,6]])
arr2.shape

(3, 2)

In [27]:
arr2.dtype

dtype('int32')

In [28]:
arr2.ndim

2

In [29]:
arr2.size

6

In [30]:
s2 = pd.Series(arr2) #Data should be 1 diementional in series

ValueError: Data must be 1-dimensional

In [31]:
## Using dictionary
d={'a':1,'b':2,'c':3,'d':4}

In [32]:
d

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [33]:
d.values()

dict_values([1, 2, 3, 4])

In [34]:
d.keys()

dict_keys(['a', 'b', 'c', 'd'])

In [35]:
d['a']

1

In [36]:
b=pd.Series(d)

In [37]:
b

a    1
b    2
c    3
d    4
dtype: int64

In [38]:
type(b)

pandas.core.series.Series

In [39]:
d=pd.Series([1,2,3,5,47,58,98,7,8,6,32,78,2,8,289,258,78])
print(d)#,end=" ")

0       1
1       2
2       3
3       5
4      47
5      58
6      98
7       7
8       8
9       6
10     32
11     78
12      2
13      8
14    289
15    258
16     78
dtype: int64

In [40]:
arr_2=np.array([1,2,3])
s_2=pd.Series(arr_2,index=['ab','bc','cd'])
s_2

ab    1
bc    2
cd    3
dtype: int32

In [41]:
## Slicing operation
d=pd.Series([1,2,3,5,47,98,7,8,6,32,78,2,8,289,258,78])
d

0       1
1       2
2       3
3       5
4      47
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [42]:
d[4:9]

4    47
5    98
6     7
7     8
8     6
dtype: int64

In [43]:
d[0:13:3] # Slicing with step

0      1
3      5
6      7
9     32
12     8
dtype: int64

In [44]:
d[[7,2,3,5]] ## extracting elements from multiple index

7     8
2     3
3     5
5    98
dtype: int64

# Add/Change

In [45]:
d[4]=34  ## changing the element

In [46]:
d[6:10]=[100,200,300,400]

In [47]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6     100
7     200
8     300
9     400
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

# DataFrame

In [50]:
df=pd.DataFrame()

In [51]:
type(df)

pandas.core.frame.DataFrame

In [52]:
## empty dataframe
d=pd.DataFrame()

In [53]:
print(d)

Empty DataFrame
Columns: []
Index: []

In [56]:
df
print(df)

Empty DataFrame
Columns: []
Index: []

In [57]:
## using nested list
data=[[1,2,3,4],[14,12,1,'a',8],[7,8,9]]

In [58]:
data

[[1, 2, 3, 4], [14, 12, 1, 'a', 8], [7, 8, 9]]

In [59]:
d

Empty DataFrame
Columns: []
Index: []

In [60]:
df2=pd.DataFrame(data)

In [61]:
df2

    0   1  2     3    4
0   1   2  3     4  NaN
1  14  12  1     a  8.0
2   7   8  9  None  NaN

In [62]:
data=[['abc',1],['def',2],['ghi',3],['hij'],['klm','5']]

In [63]:
a=pd.DataFrame(data)

In [64]:
#d=pd.DataFrame(data,columns=['A','B','C','D','E']) ## changing the column

In [65]:
df3=pd.DataFrame(data,columns=['A','B'],index=['A','B','C','D','E'])  ## changing the index

In [66]:
df3

     A     B
A  abc     1
B  def     2
C  ghi     3
D  hij  None
E  klm     5

In [67]:
## dataframe using dictonary
data={'name':['a','b','c','d','e','f'],'age':[45,12,48,25,12,56]}

In [68]:
df4=pd.DataFrame(data)#,columns=['Name','Age'])
df4

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [70]:
df4.rename({'name':'Name','age':"Age"},axis=1,inplace=True)

In [71]:
df4

  Name  Age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [72]:
## Accessing the elements from dataframe
data=[['ALex',10,'Maths'],['Bob',12,'Science'],['Kelly',15,'Eco'],
      ['Boris',14,'Geo'],['Ken',18,'English']]

In [73]:
type(data)

list

In [74]:
data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['Kelly', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [76]:
df5=pd.DataFrame(data,columns=['Name','Age','Subject'])

In [77]:
df5

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [78]:
## Accessing single column
d['Name']

0     ALex
1      Bob
2    Kelly
3    Boris
4      Ken
Name: Name, dtype: object

In [79]:
d['Age']

0    10
1    12
2    15
3    14
4    18
Name: Age, dtype: int64

In [80]:
## Accessing multiple column
d[['Name','Subject']]

    Name  Subject
0   ALex    Maths
1    Bob  Science
2  Kelly      Eco
3  Boris      Geo
4    Ken  English

In [81]:
d[1] ##to access single row

KeyError: 1

In [82]:
d.loc[1]

Name           Bob
Age             12
Subject    Science
Name: 1, dtype: object

In [83]:
d.loc[[0,1]]  #accessing multiple rows

   Name  Age  Subject
0  ALex   10    Maths
1   Bob   12  Science

In [86]:
d.loc[0:2]     # includes row 2

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco

In [87]:
d.iloc[0:2]    # excludes row 2

   Name  Age  Subject
0  ALex   10    Maths
1   Bob   12  Science

### Difference between loc and iloc

| Feature                 | loc                    | iloc                  |
| ----------------------- | ---------------------- | --------------------- |
| Type of index selection | Label-based            | Integer index-based   |
| Inclusive slicing       | Yes                    | No                    |
| Use cases               | Named rows and columns | Number-based indexing |

In [90]:
# filtering data with perticular rows and column
d.loc[0:2,['Age','Subject']]
# loc takes name of columns as well upper limit

   Age  Subject
0   10    Maths
1   12  Science
2   15      Eco

In [93]:
d[[1,2]]

KeyError: "None of [Int64Index([1, 2], dtype='int64')] are in the [columns]"

In [92]:
d.loc[[1,2]]

    Name  Age  Subject
1    Bob   12  Science
2  Kelly   15      Eco

In [94]:
d.iloc[1:4,[0,2]]    #iloc works only with index of column
# iloc exclude upper limit

    Name  Subject
1    Bob  Science
2  Kelly      Eco
3  Boris      Geo

In [95]:
# to access the single element we use iloc 
d.iloc[1,2]

'Science'

In [96]:
d['Gender'] = ['M','M','F','F','F'] # initialize and add a new column to the DataFrame
d

    Name  Age  Subject Gender
0   ALex   10    Maths      M
1    Bob   12  Science      M
2  Kelly   15      Eco      F
3  Boris   14      Geo      F
4    Ken   18  English      F

In [97]:
d['Age']=d['Age']+ 2 # broadcasting

In [98]:
d

    Name  Age  Subject Gender
0   ALex   12    Maths      M
1    Bob   14  Science      M
2  Kelly   17      Eco      F
3  Boris   16      Geo      F
4    Ken   20  English      F